3B/SE464/src/06-DB-Scaling.org
#+title: DB Scaling
#+author: Arnav Gupta
#+LATEX_HEADER: \usepackage{parskip,darkmode}
#+LATEX_HEADER: \enabledarkmode
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="src/latex.css" />

* DB Recap
DBs provide persistent storage and coordination in a large-scale system (also biggest scalability
challenges).

Disk 10 billion times larger than registers but 10 million times larger delay.

Goal is to work with registers, caches, and RAM, rather than SSD and disk.

All computer storage is limited to reads/writes.

*Magnetic disks*: read/write head can read charges on a tiny portion of the magnetic disk

*RAM (memory)*: memory and flash chips store lots of data, but only few bytes can be transferred at once
since only couple hundred electrical connections at the edge

*SSD (flash)* similar to RAM but with fewer electrical connection

** RAID: Redundant Array of Independent Disks
Disks have limits on capacity (12 TB), throughput (150 MB/s), and likelihood of failure.

*RAID* uses multiple disks:
- increase _capacity_ through multiple disks
- increase _throughput_ by accessing data in parallel on multiple disks
- reduce impact of _failure_ by storing data redundantly on multiple disks

Disk interface is just array of sectors, so easy to crease *logical/virtual disk* made of sectors
from multiple physical disks.

Unlimited capacity but computer has:
- limited compute power
- limited IO bandwidth

Single machine design scales well, so used by relational DBs.

Programming languages deal with storage directly (except SQL):
- programmer writes code to move data from memory to disk
- disk use must be purposeful

Normal way of accessing persistent storage is to pass data in and out of files using open/read/write
functions.
DBs let programmer use persistent storage without considering files and with advanced performance
optimizations, using some query language.

* Relational DB
Store data in multiple tables with predefined schema (set of columns).
Rows are added over time and can refer to other rows through foreign keys.

Many tables allows:
- many users to refer to shared region data without repetition or inconsistency
- a user to have an arbitrary number of positions

A relational DB allows many-to-one and many-to-many relationships while keeping columns finite and
clearly defined.

DB *schema* defined tables, columns, primary and foreign keys.

Relational DB benefits:
- _scalability_: work with data larger than RAM
- _persistence_: keep data after program finishes
- _indexing_: efficiently sort and search along various dimensions
- _concurrency_: multiple users/applications can read/write
- _analysis_: SQL query language is concise yet powerful
- _integrity_: restrict data type, duplicate entries, and transactions
- _deduplication_: save space, keep common data consistent
- _security_: different users can access specific data

Using file system does not give analysis, integrity, and deduplication, and is not as good for
indexing (just filename/path) or concurrency (no transactions).

