3B/SE464/06-DB-Scaling.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-12-07 Sat 16:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>DB Scaling</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/latex.css" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">DB Scaling</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5bbee5a">1. DB Recap</a>
<ul>
<li><a href="#org0bd44fb">1.1. RAID: Redundant Array of Independent Disks</a></li>
</ul>
</li>
<li><a href="#orga5eb0ae">2. Relational DB</a></li>
<li><a href="#org9d102ca">3. DB Indexes</a></li>
<li><a href="#org7b96be2">4. DB Scaling</a>
<ul>
<li><a href="#org49d25c0">4.1. Read Replicas</a></li>
<li><a href="#orgd8ad9e8">4.2. Sharding</a></li>
</ul>
</li>
<li><a href="#orga1177e4">5. NoSQL</a>
<ul>
<li><a href="#org90bcee9">5.1. Hash Table</a></li>
</ul>
</li>
<li><a href="#orgd1e9ddc">6. Distributed DB Consistency</a>
<ul>
<li><a href="#orgf33a17b">6.1. Shared-Nothing Architecture</a></li>
<li><a href="#org6fb2787">6.2. Consistency</a></li>
</ul>
</li>
<li><a href="#org9d59223">7. Choosing a DB</a>
<ul>
<li><a href="#orgd3cd27f">7.1. Relational DB</a></li>
<li><a href="#org112e5e2">7.2. NoSQL DB</a></li>
<li><a href="#orgde41482">7.3. Column-Oriented Relational DB</a></li>
<li><a href="#orgafd134f">7.4. Semi-Structured Stores</a></li>
<li><a href="#orgd456908">7.5. Distributed Cache</a></li>
<li><a href="#orgff128ae">7.6. Networked File Systems and Cloud</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org5bbee5a" class="outline-2">
<h2 id="org5bbee5a"><span class="section-number-2">1.</span> DB Recap</h2>
<div class="outline-text-2" id="text-1">
<p>
DBs provide persistent storage and coordination in a large-scale system (also biggest scalability
challenges).
</p>

<p>
Disk 10 billion times larger than registers but 10 million times larger delay.
</p>

<p>
Goal is to work with registers, caches, and RAM, rather than SSD and disk.
</p>

<p>
All computer storage is limited to reads/writes.
</p>

<p>
<b>Magnetic disks</b>: read/write head can read charges on a tiny portion of the magnetic disk
</p>

<p>
<b>RAM (memory)</b>: memory and flash chips store lots of data, but only few bytes can be transferred at once
since only couple hundred electrical connections at the edge
</p>

<p>
<b>SSD (flash)</b> similar to RAM but with fewer electrical connection
</p>
</div>
<div id="outline-container-org0bd44fb" class="outline-3">
<h3 id="org0bd44fb"><span class="section-number-3">1.1.</span> RAID: Redundant Array of Independent Disks</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Disks have limits on capacity (12 TB), throughput (150 MB/s), and likelihood of failure.
</p>

<p>
<b>RAID</b> uses multiple disks:
</p>
<ul class="org-ul">
<li>increase <span class="underline">capacity</span> through multiple disks</li>
<li>increase <span class="underline">throughput</span> by accessing data in parallel on multiple disks</li>
<li>reduce impact of <span class="underline">failure</span> by storing data redundantly on multiple disks</li>
</ul>

<p>
Disk interface is just array of sectors, so easy to crease <b>logical/virtual disk</b> made of sectors
from multiple physical disks.
</p>

<p>
Unlimited capacity but computer has:
</p>
<ul class="org-ul">
<li>limited compute power</li>
<li>limited IO bandwidth</li>
</ul>

<p>
Single machine design scales well, so used by relational DBs.
</p>

<p>
Programming languages deal with storage directly (except SQL):
</p>
<ul class="org-ul">
<li>programmer writes code to move data from memory to disk</li>
<li>disk use must be purposeful</li>
</ul>

<p>
Normal way of accessing persistent storage is to pass data in and out of files using open/read/write
functions.
DBs let programmer use persistent storage without considering files and with advanced performance
optimizations, using some query language.
</p>
</div>
</div>
</div>
<div id="outline-container-orga5eb0ae" class="outline-2">
<h2 id="orga5eb0ae"><span class="section-number-2">2.</span> Relational DB</h2>
<div class="outline-text-2" id="text-2">
<p>
Store data in multiple tables with predefined schema (set of columns).
Rows are added over time and can refer to other rows through foreign keys.
</p>

<p>
Many tables allows:
</p>
<ul class="org-ul">
<li>many users to refer to shared region data without repetition or inconsistency</li>
<li>a user to have an arbitrary number of positions</li>
</ul>

<p>
A relational DB allows many-to-one and many-to-many relationships while keeping columns finite and
clearly defined.
</p>

<p>
DB <b>schema</b> defined tables, columns, primary and foreign keys.
</p>

<p>
Relational DB benefits:
</p>
<ul class="org-ul">
<li><span class="underline">scalability</span>: work with data larger than RAM</li>
<li><span class="underline">persistence</span>: keep data after program finishes</li>
<li><span class="underline">indexing</span>: efficiently sort and search along various dimensions</li>
<li><span class="underline">concurrency</span>: multiple users/applications can read/write</li>
<li><span class="underline">analysis</span>: SQL query language is concise yet powerful</li>
<li><span class="underline">integrity</span>: restrict data type, duplicate entries, and transactions</li>
<li><span class="underline">deduplication</span>: save space, keep common data consistent</li>
<li><span class="underline">security</span>: different users can access specific data</li>
</ul>

<p>
Using file system does not give analysis, integrity, and deduplication, and is not as good for
indexing (just filename/path) or concurrency (no transactions).
</p>
</div>
</div>
