3B/SE464/06-DB-Scaling.tex
% Created 2024-12-07 Sat 16:59
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{parskip,darkmode}
\enabledarkmode
\author{Arnav Gupta}
\date{\today}
\title{DB Scaling}
\hypersetup{
 pdfauthor={Arnav Gupta},
 pdftitle={DB Scaling},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{DB Recap}
\label{sec:orgeeb01e7}
DBs provide persistent storage and coordination in a large-scale system (also biggest scalability
challenges).

Disk 10 billion times larger than registers but 10 million times larger delay.

Goal is to work with registers, caches, and RAM, rather than SSD and disk.

All computer storage is limited to reads/writes.

\textbf{Magnetic disks}: read/write head can read charges on a tiny portion of the magnetic disk

\textbf{RAM (memory)}: memory and flash chips store lots of data, but only few bytes can be transferred at once
since only couple hundred electrical connections at the edge

\textbf{SSD (flash)} similar to RAM but with fewer electrical connection
\subsection{RAID: Redundant Array of Independent Disks}
\label{sec:orgd352b4a}
Disks have limits on capacity (12 TB), throughput (150 MB/s), and likelihood of failure.

\textbf{RAID} uses multiple disks:
\begin{itemize}
\item increase \uline{capacity} through multiple disks
\item increase \uline{throughput} by accessing data in parallel on multiple disks
\item reduce impact of \uline{failure} by storing data redundantly on multiple disks
\end{itemize}

Disk interface is just array of sectors, so easy to crease \textbf{logical/virtual disk} made of sectors
from multiple physical disks.

Unlimited capacity but computer has:
\begin{itemize}
\item limited compute power
\item limited IO bandwidth
\end{itemize}

Single machine design scales well, so used by relational DBs.

Programming languages deal with storage directly (except SQL):
\begin{itemize}
\item programmer writes code to move data from memory to disk
\item disk use must be purposeful
\end{itemize}

Normal way of accessing persistent storage is to pass data in and out of files using open/read/write
functions.
DBs let programmer use persistent storage without considering files and with advanced performance
optimizations, using some query language.
\section{Relational DB}
\label{sec:orgc5113f4}
Store data in multiple tables with predefined schema (set of columns).
Rows are added over time and can refer to other rows through foreign keys.

Many tables allows:
\begin{itemize}
\item many users to refer to shared region data without repetition or inconsistency
\item a user to have an arbitrary number of positions
\end{itemize}

A relational DB allows many-to-one and many-to-many relationships while keeping columns finite and
clearly defined.

DB \textbf{schema} defined tables, columns, primary and foreign keys.

Relational DB benefits:
\begin{itemize}
\item \uline{scalability}: work with data larger than RAM
\item \uline{persistence}: keep data after program finishes
\item \uline{indexing}: efficiently sort and search along various dimensions
\item \uline{concurrency}: multiple users/applications can read/write
\item \uline{analysis}: SQL query language is concise yet powerful
\item \uline{integrity}: restrict data type, duplicate entries, and transactions
\item \uline{deduplication}: save space, keep common data consistent
\item \uline{security}: different users can access specific data
\end{itemize}

Using file system does not give analysis, integrity, and deduplication, and is not as good for
indexing (just filename/path) or concurrency (no transactions).
