3B/SE464/src/06-DB-Scaling.org
* DB Indexes
Sorting data can be helpful for search (binary search).

Sorting is not a complete fix since:
- can't sort in multiple dimensions
- insert new data without shifting (requires rewrites)
- does not take advantage of storage hierarchy (access disk in every step since index spread over
  full data set)

DB indexes use tree or hashtable, giving logarithmic speed, while allowing quick insert/delete.

Indexes are defined when table is created (primary key unique for each row).
Must be able to quickly check that new value does not already exist, so index on primary key.

Certain queries are too slow.
Without proper indexes, DBMS examines every row, so adding 1+ indexes dramatically speeds up query.

#+BEGIN_SRC sql
CREATE INDEX index_name ON table_name ( column_name );
#+END_SRC

Multiple indexes allows finding rows based on multiple criteria.

DBMS must translate query into table lookups, trying the most efficient choices (indexes help).
Can analyze query execution plan with ~EXPLAIN~ keyword.

Index columns if used in ~WHERE~ conditions, ~JOIN~ conditions, in ~MIN~ or ~MAX~ aggregation
function, or a foreign key refers to it.

Indexes consume storage space and must be updated when data modified, so don't add unless necessary.

* DB Scaling
Load balancer does much less work per request than DB.

DB clones are hard due to coordination.

*Query planners* optimize order of table accesses and index use.
RAM used to store more important data and indexes.
Responses can be cached and replayed if data unchanged.

To avoid DB bottleneck:
- avoid unnecessary queries (cache data in frontend)
- buy fast machine with RAM for caching
- use fastest possible disks (SSDs, RAID)
- use *read replicas* or *sharding*

** Read Replicas
Most DB traffic is reads.
*Replicas* have full copy of all data and can handle reads.

All writes must go to *primary* server, with data changes pushed to read replicas.

Replicas can be behind primary, so sensitive reads should use primary.

Too many replicas would make data push process a bottleneck in the primary.

Read replicas not infinitely scalable, primary is central bottleneck.
Primary must send each replica copies of each write.

Optimal number of replicas directly proportional to the ratio of reads and writes, \approx{}10 in
typical app.

Multi-level replication can extend read-scalability, with reads going to bottom level replicas
and middle-level replicas pushing to children.

Adding more replication levels gives width but adds more delay between write at primary and
data availability at read replicas.

Use read-replicas through load balancer in front of read-replicas.

With read-replicas, writes are not scalable, capacity is not scalable, and primary is a single
point of failure.

5tandby primary can help to take over if main primary fail (app switches if main primary stops
responding).

Using multiple primaries gives same performance bottleneck and could introduce data inconsistency
for concurrent operations.

** Sharding
For horizontal scaling of writes and capacity:
- *functional partitioning*: create DBs to store different categories/types of data
  - limits queries joining rows in tables in different DB
  - only few functional partitions possible (not scalable)
- *data partitioning*

With *sharding*, divide data universe into disjoint subsets called *shards*.

*Sharding key* determines assignment of rows to shards.

Relational DBs don't support sharding natively, so must be done at application level.

Sharding benefits:
- capacity scales
- data consistent
- if sharding key chosen carefully
  - balanced data
  - many queries involve only 1 or
    few shards, so no central
    bottleneck

Sharding downsides
- cannot use plain SQL
- queries must be adapted for sharding
- if key chosen poorly, shard load is imbalanced,
  by capacity or traffic
- some queries involve all shards, so capacity
  is limited by single machine's speed

For $N$ nodes, total request rate $R$, node capacity $C$:
- if each request send to one node: $R_{max} = NC$
- if each request sent to constant $k$ nodes: $R_{max} = NC/k = \mathcal{O}(NC)$
- if each request sent to all nodes: $R_{max} = C$

