3B/SE464/06-DB-Scaling.html
<div id="outline-container-org9d102ca" class="outline-2">
<h2 id="org9d102ca"><span class="section-number-2">3.</span> DB Indexes</h2>
<div class="outline-text-2" id="text-3">
<p>
Sorting data can be helpful for search (binary search).
</p>

<p>
Sorting is not a complete fix since:
</p>
<ul class="org-ul">
<li>can&rsquo;t sort in multiple dimensions</li>
<li>insert new data without shifting (requires rewrites)</li>
<li>does not take advantage of storage hierarchy (access disk in every step since index spread over
full data set)</li>
</ul>

<p>
DB indexes use tree or hashtable, giving logarithmic speed, while allowing quick insert/delete.
</p>

<p>
Indexes are defined when table is created (primary key unique for each row).
Must be able to quickly check that new value does not already exist, so index on primary key.
</p>

<p>
Certain queries are too slow.
Without proper indexes, DBMS examines every row, so adding 1+ indexes dramatically speeds up query.
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #51afef;">CREATE</span> INDEX index_name <span style="color: #51afef;">ON</span> <span style="color: #51afef;">table_name</span> ( <span style="color: #51afef;">column_name</span> );
</pre>
</div>

<p>
Multiple indexes allows finding rows based on multiple criteria.
</p>

<p>
DBMS must translate query into table lookups, trying the most efficient choices (indexes help).
Can analyze query execution plan with <code>EXPLAIN</code> keyword.
</p>

<p>
Index columns if used in <code>WHERE</code> conditions, <code>JOIN</code> conditions, in <code>MIN</code> or <code>MAX</code> aggregation
function, or a foreign key refers to it.
</p>

<p>
Indexes consume storage space and must be updated when data modified, so don&rsquo;t add unless necessary.
</p>
</div>
</div>
<div id="outline-container-org7b96be2" class="outline-2">
<h2 id="org7b96be2"><span class="section-number-2">4.</span> DB Scaling</h2>
<div class="outline-text-2" id="text-4">
<p>
Load balancer does much less work per request than DB.
</p>

<p>
DB clones are hard due to coordination.
</p>

<p>
<b>Query planners</b> optimize order of table accesses and index use.
RAM used to store more important data and indexes.
Responses can be cached and replayed if data unchanged.
</p>

<p>
To avoid DB bottleneck:
</p>
<ul class="org-ul">
<li>avoid unnecessary queries (cache data in frontend)</li>
<li>buy fast machine with RAM for caching</li>
<li>use fastest possible disks (SSDs, RAID)</li>
<li>use <b>read replicas</b> or <b>sharding</b></li>
</ul>
</div>
<div id="outline-container-org49d25c0" class="outline-3">
<h3 id="org49d25c0"><span class="section-number-3">4.1.</span> Read Replicas</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Most DB traffic is reads.
<b>Replicas</b> have full copy of all data and can handle reads.
</p>

<p>
All writes must go to <b>primary</b> server, with data changes pushed to read replicas.
</p>

<p>
Replicas can be behind primary, so sensitive reads should use primary.
</p>

<p>
Too many replicas would make data push process a bottleneck in the primary.
</p>

<p>
Read replicas not infinitely scalable, primary is central bottleneck.
Primary must send each replica copies of each write.
</p>

<p>
Optimal number of replicas directly proportional to the ratio of reads and writes, &asymp;10 in
typical app.
</p>

<p>
Multi-level replication can extend read-scalability, with reads going to bottom level replicas
and middle-level replicas pushing to children.
</p>

<p>
Adding more replication levels gives width but adds more delay between write at primary and
data availability at read replicas.
</p>

<p>
Use read-replicas through load balancer in front of read-replicas.
</p>

<p>
With read-replicas, writes are not scalable, capacity is not scalable, and primary is a single
point of failure.
</p>

<p>
5tandby primary can help to take over if main primary fail (app switches if main primary stops
responding).
</p>

<p>
Using multiple primaries gives same performance bottleneck and could introduce data inconsistency
for concurrent operations.
</p>
</div>
</div>
<div id="outline-container-orgd8ad9e8" class="outline-3">
<h3 id="orgd8ad9e8"><span class="section-number-3">4.2.</span> Sharding</h3>
<div class="outline-text-3" id="text-4-2">
<p>
For horizontal scaling of writes and capacity:
</p>
<ul class="org-ul">
<li><b>functional partitioning</b>: create DBs to store different categories/types of data
<ul class="org-ul">
<li>limits queries joining rows in tables in different DB</li>
<li>only few functional partitions possible (not scalable)</li>
</ul></li>
<li><b>data partitioning</b></li>
</ul>

<p>
With <b>sharding</b>, divide data universe into disjoint subsets called <b>shards</b>.
</p>

<p>
<b>Sharding key</b> determines assignment of rows to shards.
</p>

<p>
Relational DBs don&rsquo;t support sharding natively, so must be done at application level.
</p>

<p>
Sharding benefits:
</p>
<ul class="org-ul">
<li>capacity scales</li>
<li>data consistent</li>
<li>if sharding key chosen carefully
<ul class="org-ul">
<li>balanced data</li>
<li>many queries involve only 1 or
few shards, so no central
bottleneck</li>
</ul></li>
</ul>

<p>
Sharding downsides
</p>
<ul class="org-ul">
<li>cannot use plain SQL</li>
<li>queries must be adapted for sharding</li>
<li>if key chosen poorly, shard load is imbalanced,
by capacity or traffic</li>
<li>some queries involve all shards, so capacity
is limited by single machine&rsquo;s speed</li>
</ul>

<p>
For \(N\) nodes, total request rate \(R\), node capacity \(C\):
</p>
<ul class="org-ul">
<li>if each request send to one node: \(R_{max} = NC\)</li>
<li>if each request sent to constant \(k\) nodes: \(R_{max} = NC/k = \mathcal{O}(NC)\)</li>
<li>if each request sent to all nodes: \(R_{max} = C\)</li>
</ul>
</div>
</div>
</div>
