3B/SE464/src/06-DB-Scaling.org
* NoSQL
Sharding does not work well if all nodes involved (scaling limited).
NoSQL databases solve problem by *denormalizing* data, so duplicated data isolates queries to one node.

*Normalized* relational DB has no duplication of data.
Foreign keys point to shared data.
To optimally partition rows into shards, can solve balanced graph partitioning problem.

*Balanced Graph Partitioning* model for DB sharding:
- nodes represent DB rows, edges represent FKs
- partition nodes, such that
  - total edges between partitions is minimized (need to fetch data from another shard is minimized)
  - nodes per partition is roughly balanced (balanced shards)

Solving graph problem is NP-complete.
Model's cost is too simplistic (does not account for frequency).

Even with optimal partitioning, still have FKs between partitions.

Data affects solution quality since:
- random interconnections hurt
- nodes with high degree (many edges) hurt
- structured, independent relations are easy
- nodes with single edge are easy

By removing FKs and JOINs with NoSQL, no more references, so *denormalized* data allows for easy
partitioning, since there are just copies of references data.

NoSQL DBs are key-value stores using a single column and a single table (usually).

A single column is required since no references (unknown schema) and unknown positions.
Some NoSQL DBs allow multiple columns, but each row can have different columns.

Some NoSQL DBs allow multiple tables, but since rows can have any format, no need to.

** Hash Table
*Hash*: algorithm that takes value and returns pseudo-random value derived from it (constant but
unpredictable)

Same input always gives same output. Input length can vary but output has fixed length.

*Hash Table*: stores key-value pairs

Hash the key to determine address where value is stored. If address already full (collision), use next open
slot.

Hash table is alternative to search tree (find data in single step), but bad with ranges.

In a *distributed hash table*:
- each cluster node responsible for a range of hash values
- each client gets list of nodes and range assigned to each
- when querying for key's value, client computes key hash to determine which node to query
  for data

NoSQL DBs use distributed hash table.
Interface is /get/ a value for a key or /put/ a value for a key.

Each operation only affects the node storing that key, so very scalable.

For distributed, shared-nothing architecture:
1. create *cluster* of computers connected to each other
2. each node in the cluster stores a fraction of the data set

NoSQL Downsides:
- just one indexed column (key) since index built with hash-based partitioning
- denormalized data is duplicated (wastes space and must be edited everywhere)
- references possible but following reference requires another query, probably to another node
  (no constraint checking)

Normalized data would not perform well in a NoSQL DB.
References not enforced by schema, so can become broken.

* Distributed DB Consistency
To find data, client must have list of all nodes, and *hash ranges* assigned to each node.
Sharing the node/range info is a *distributed consensus* problem.

** Shared-Nothing Architecture
Each request handled by one node (no bottlenecks).
Both _throughput_ and _capacity_ directly proportional to number of nodes.

Distributed Hash Tables can scale to 1000s of nodes.

Many nodes means high chance of node failure, so must replicate data to avoid loss.
Can create overlap in hash ranges covered by nodes.

Replicating data introduces possibility of inconsistency.

