3B/SE464/06-DB-Scaling.html
<div id="outline-container-orga1177e4" class="outline-2">
<h2 id="orga1177e4"><span class="section-number-2">5.</span> NoSQL</h2>
<div class="outline-text-2" id="text-5">
<p>
Sharding does not work well if all nodes involved (scaling limited).
NoSQL databases solve problem by <b>denormalizing</b> data, so duplicated data isolates queries to one node.
</p>

<p>
<b>Normalized</b> relational DB has no duplication of data.
Foreign keys point to shared data.
To optimally partition rows into shards, can solve balanced graph partitioning problem.
</p>

<p>
<b>Balanced Graph Partitioning</b> model for DB sharding:
</p>
<ul class="org-ul">
<li>nodes represent DB rows, edges represent FKs</li>
<li>partition nodes, such that
<ul class="org-ul">
<li>total edges between partitions is minimized (need to fetch data from another shard is minimized)</li>
<li>nodes per partition is roughly balanced (balanced shards)</li>
</ul></li>
</ul>

<p>
Solving graph problem is NP-complete.
Model&rsquo;s cost is too simplistic (does not account for frequency).
</p>

<p>
Even with optimal partitioning, still have FKs between partitions.
</p>

<p>
Data affects solution quality since:
</p>
<ul class="org-ul">
<li>random interconnections hurt</li>
<li>nodes with high degree (many edges) hurt</li>
<li>structured, independent relations are easy</li>
<li>nodes with single edge are easy</li>
</ul>

<p>
By removing FKs and JOINs with NoSQL, no more references, so <b>denormalized</b> data allows for easy
partitioning, since there are just copies of references data.
</p>

<p>
NoSQL DBs are key-value stores using a single column and a single table (usually).
</p>

<p>
A single column is required since no references (unknown schema) and unknown positions.
Some NoSQL DBs allow multiple columns, but each row can have different columns.
</p>

<p>
Some NoSQL DBs allow multiple tables, but since rows can have any format, no need to.
</p>
</div>
<div id="outline-container-org90bcee9" class="outline-3">
<h3 id="org90bcee9"><span class="section-number-3">5.1.</span> Hash Table</h3>
<div class="outline-text-3" id="text-5-1">
<p>
<b>Hash</b>: algorithm that takes value and returns pseudo-random value derived from it (constant but
unpredictable)
</p>

<p>
Same input always gives same output. Input length can vary but output has fixed length.
</p>

<p>
<b>Hash Table</b>: stores key-value pairs
</p>

<p>
Hash the key to determine address where value is stored. If address already full (collision), use next open
slot.
</p>

<p>
Hash table is alternative to search tree (find data in single step), but bad with ranges.
</p>

<p>
In a <b>distributed hash table</b>:
</p>
<ul class="org-ul">
<li>each cluster node responsible for a range of hash values</li>
<li>each client gets list of nodes and range assigned to each</li>
<li>when querying for key&rsquo;s value, client computes key hash to determine which node to query
for data</li>
</ul>

<p>
NoSQL DBs use distributed hash table.
Interface is <i>get</i> a value for a key or <i>put</i> a value for a key.
</p>

<p>
Each operation only affects the node storing that key, so very scalable.
</p>

<p>
For distributed, shared-nothing architecture:
</p>
<ol class="org-ol">
<li>create <b>cluster</b> of computers connected to each other</li>
<li>each node in the cluster stores a fraction of the data set</li>
</ol>

<p>
NoSQL Downsides:
</p>
<ul class="org-ul">
<li>just one indexed column (key) since index built with hash-based partitioning</li>
<li>denormalized data is duplicated (wastes space and must be edited everywhere)</li>
<li>references possible but following reference requires another query, probably to another node
(no constraint checking)</li>
</ul>

<p>
Normalized data would not perform well in a NoSQL DB.
References not enforced by schema, so can become broken.
</p>
</div>
</div>
</div>
<div id="outline-container-orgd1e9ddc" class="outline-2">
<h2 id="orgd1e9ddc"><span class="section-number-2">6.</span> Distributed DB Consistency</h2>
<div class="outline-text-2" id="text-6">
<p>
To find data, client must have list of all nodes, and <b>hash ranges</b> assigned to each node.
Sharing the node/range info is a <b>distributed consensus</b> problem.
</p>
</div>
<div id="outline-container-orgf33a17b" class="outline-3">
<h3 id="orgf33a17b"><span class="section-number-3">6.1.</span> Shared-Nothing Architecture</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Each request handled by one node (no bottlenecks).
Both <span class="underline">throughput</span> and <span class="underline">capacity</span> directly proportional to number of nodes.
</p>

<p>
Distributed Hash Tables can scale to 1000s of nodes.
</p>

<p>
Many nodes means high chance of node failure, so must replicate data to avoid loss.
Can create overlap in hash ranges covered by nodes.
</p>

<p>
Replicating data introduces possibility of inconsistency.
</p>
</div>
</div>
