3B/SE464/06-DB-Scaling.tex
\section{NoSQL}
\label{sec:org87c03ca}
Sharding does not work well if all nodes involved (scaling limited).
NoSQL databases solve problem by \textbf{denormalizing} data, so duplicated data isolates queries to one node.

\textbf{Normalized} relational DB has no duplication of data.
Foreign keys point to shared data.
To optimally partition rows into shards, can solve balanced graph partitioning problem.

\textbf{Balanced Graph Partitioning} model for DB sharding:
\begin{itemize}
\item nodes represent DB rows, edges represent FKs
\item partition nodes, such that
\begin{itemize}
\item total edges between partitions is minimized (need to fetch data from another shard is minimized)
\item nodes per partition is roughly balanced (balanced shards)
\end{itemize}
\end{itemize}

Solving graph problem is NP-complete.
Model's cost is too simplistic (does not account for frequency).

Even with optimal partitioning, still have FKs between partitions.

Data affects solution quality since:
\begin{itemize}
\item random interconnections hurt
\item nodes with high degree (many edges) hurt
\item structured, independent relations are easy
\item nodes with single edge are easy
\end{itemize}

By removing FKs and JOINs with NoSQL, no more references, so \textbf{denormalized} data allows for easy
partitioning, since there are just copies of references data.

NoSQL DBs are key-value stores using a single column and a single table (usually).

A single column is required since no references (unknown schema) and unknown positions.
Some NoSQL DBs allow multiple columns, but each row can have different columns.

Some NoSQL DBs allow multiple tables, but since rows can have any format, no need to.
\subsection{Hash Table}
\label{sec:org1225cc8}
\textbf{Hash}: algorithm that takes value and returns pseudo-random value derived from it (constant but
unpredictable)

Same input always gives same output. Input length can vary but output has fixed length.

\textbf{Hash Table}: stores key-value pairs

Hash the key to determine address where value is stored. If address already full (collision), use next open
slot.

Hash table is alternative to search tree (find data in single step), but bad with ranges.

In a \textbf{distributed hash table}:
\begin{itemize}
\item each cluster node responsible for a range of hash values
\item each client gets list of nodes and range assigned to each
\item when querying for key's value, client computes key hash to determine which node to query
for data
\end{itemize}

NoSQL DBs use distributed hash table.
Interface is \emph{get} a value for a key or \emph{put} a value for a key.

Each operation only affects the node storing that key, so very scalable.

For distributed, shared-nothing architecture:
\begin{enumerate}
\item create \textbf{cluster} of computers connected to each other
\item each node in the cluster stores a fraction of the data set
\end{enumerate}

NoSQL Downsides:
\begin{itemize}
\item just one indexed column (key) since index built with hash-based partitioning
\item denormalized data is duplicated (wastes space and must be edited everywhere)
\item references possible but following reference requires another query, probably to another node
(no constraint checking)
\end{itemize}

Normalized data would not perform well in a NoSQL DB.
References not enforced by schema, so can become broken.
\section{Distributed DB Consistency}
\label{sec:orgaf4d2c5}
To find data, client must have list of all nodes, and \textbf{hash ranges} assigned to each node.
Sharing the node/range info is a \textbf{distributed consensus} problem.
\subsection{Shared-Nothing Architecture}
\label{sec:org245f90f}
Each request handled by one node (no bottlenecks).
Both \uline{throughput} and \uline{capacity} directly proportional to number of nodes.

Distributed Hash Tables can scale to 1000s of nodes.

Many nodes means high chance of node failure, so must replicate data to avoid loss.
Can create overlap in hash ranges covered by nodes.

Replicating data introduces possibility of inconsistency.
