3B/SE464/src/06-DB-Scaling.org
** Consistency
*CAP Theorem*: a distributed system cannot achieve all 3 of the following:
- *Consistency*: reads always get the most recent write
- *Availability*: every request received a non-error response
- *Partition Tolerance*: arbitrary number of messages between nodes can be dropped (or delayed)

When distributed DB nodes are out-of-sync, must either accept consistent responses or wait for nodes
to resynchronize.

To build distributed DB where every request immediately gets a globally correct response, need a network
that is 100% reliable and has no delay.

CAP theorem gives tradeoff between consistency and delay.
Inconsistency more important than delay (only centralized DB can give both).

Distributed NoSQL DB designs give different options for handling consistency/delay tradeoff.

Client-centric consistency properties:
- *monotonic reads*: if client reads the value of $x$, later reads of $x$ by the same client will
  return the same value or a more recently written value
  - can fail from reads from different nodes during incomplete write
  - prevent problem by making client connect to same node for every request or delay second request
- *read your writes*: if client writes value to $x$, later reads of $x$ by the same client always returns
  same value or a more recently written value
  - can fail if system allows write on one node and read from another
  - prevent problem by making client connect to same node for every request or delay second request
- *monotonic writes*: if client writes twice to $x$, first write must happen before second
  - second write can occur on a node before first write arrives
  - does not matter unless writes are cumulative
  - prevent problem by making client connect to same node for every request or delay second request

To achieve consistency:
1. make client send all requests to one replica node
   a. simple solution, but consistency problems arise when node fails
2. make client wait until read or write is synchronized across whole system
   a. simplest approach is for client to send request to all nodes and wait

For _monotonic read_, wait for all nodes to return same value.
For _read your writes_, wait for all nodes to acknowledge write.

*Quorum*: min percentage of committee needed to act

Wait for quorum of acknowledgment of consistent data before considering read/write completed
Prevent progress until replicas have certain degree of consistency.

Read/write quorum of majority gives balanced read/write performance.

Send request to all nodes but wait for quorum of responses.

In practice, there can be many nodes, but a constant number of replicas for each data key.
Quorum only applies to replica nodes.

A distributed system is *linearizable* if the partial ordering of distributed actions is preserved:
- distributed actors each know the order of their own actions
- certain knowledge must never be contradicted by the distributed system
- creates a partial ordering of all events in the distributed system

Every observed serialization of the parallel activity must be agreeable to individual actors.
Observations will vary across the system.

In addition to NoSQL DBs, distributed file systems can use DHTs.
Path is key, value is file contents.

* Choosing a DB
** Relational DB
Relational DB is most common, traditional solution.
Use transactions for steps to be completed atomically together.

** NoSQL DB
Transactions less common on NoSQL DBs, since slow.
Transactions less necessary since a single key stores a lot of related data that can be modified at once.

Transaction can be implemented by locking the keys involved:
1. lock keys involved (lock prevents reads/writes)
   a. replicas must agree to lock
   b. multiple competing lock requests may occur in parallel, but once must
      be chosen, so multiple rounds of communication may be needed to agree
2. execute transaction on all replaces, and wait for all to confirm
3. unlock key involved (let reads/writes proceed)

To implement distributed lock:
- requires atomic conditional write operation
  - many NoSQL DBs support something like this
- if scalability not a concern
  - store transactional data in a SQL DB
  - use a SQL DB to implement lock used to control access in NoSQL

