3B/SE464/06-DB-Scaling.html
<div id="outline-container-org6fb2787" class="outline-3">
<h3 id="org6fb2787"><span class="section-number-3">6.2.</span> Consistency</h3>
<div class="outline-text-3" id="text-6-2">
<p>
<b>CAP Theorem</b>: a distributed system cannot achieve all 3 of the following:
</p>
<ul class="org-ul">
<li><b>Consistency</b>: reads always get the most recent write</li>
<li><b>Availability</b>: every request received a non-error response</li>
<li><b>Partition Tolerance</b>: arbitrary number of messages between nodes can be dropped (or delayed)</li>
</ul>

<p>
When distributed DB nodes are out-of-sync, must either accept consistent responses or wait for nodes
to resynchronize.
</p>

<p>
To build distributed DB where every request immediately gets a globally correct response, need a network
that is 100% reliable and has no delay.
</p>

<p>
CAP theorem gives tradeoff between consistency and delay.
Inconsistency more important than delay (only centralized DB can give both).
</p>

<p>
Distributed NoSQL DB designs give different options for handling consistency/delay tradeoff.
</p>

<p>
Client-centric consistency properties:
</p>
<ul class="org-ul">
<li><b>monotonic reads</b>: if client reads the value of \(x\), later reads of \(x\) by the same client will
return the same value or a more recently written value
<ul class="org-ul">
<li>can fail from reads from different nodes during incomplete write</li>
<li>prevent problem by making client connect to same node for every request or delay second request</li>
</ul></li>
<li><b>read your writes</b>: if client writes value to \(x\), later reads of \(x\) by the same client always returns
same value or a more recently written value
<ul class="org-ul">
<li>can fail if system allows write on one node and read from another</li>
<li>prevent problem by making client connect to same node for every request or delay second request</li>
</ul></li>
<li><b>monotonic writes</b>: if client writes twice to \(x\), first write must happen before second
<ul class="org-ul">
<li>second write can occur on a node before first write arrives</li>
<li>does not matter unless writes are cumulative</li>
<li>prevent problem by making client connect to same node for every request or delay second request</li>
</ul></li>
</ul>

<p>
To achieve consistency:
</p>
<ol class="org-ol">
<li>make client send all requests to one replica node
<ol class="org-ol">
<li>simple solution, but consistency problems arise when node fails</li>
</ol></li>
<li>make client wait until read or write is synchronized across whole system
<ol class="org-ol">
<li>simplest approach is for client to send request to all nodes and wait</li>
</ol></li>
</ol>

<p>
For <span class="underline">monotonic read</span>, wait for all nodes to return same value.
For <span class="underline">read your writes</span>, wait for all nodes to acknowledge write.
</p>

<p>
<b>Quorum</b>: min percentage of committee needed to act
</p>

<p>
Wait for quorum of acknowledgment of consistent data before considering read/write completed
Prevent progress until replicas have certain degree of consistency.
</p>

<p>
Read/write quorum of majority gives balanced read/write performance.
</p>

<p>
Send request to all nodes but wait for quorum of responses.
</p>

<p>
In practice, there can be many nodes, but a constant number of replicas for each data key.
Quorum only applies to replica nodes.
</p>

<p>
A distributed system is <b>linearizable</b> if the partial ordering of distributed actions is preserved:
</p>
<ul class="org-ul">
<li>distributed actors each know the order of their own actions</li>
<li>certain knowledge must never be contradicted by the distributed system</li>
<li>creates a partial ordering of all events in the distributed system</li>
</ul>

<p>
Every observed serialization of the parallel activity must be agreeable to individual actors.
Observations will vary across the system.
</p>

<p>
In addition to NoSQL DBs, distributed file systems can use DHTs.
Path is key, value is file contents.
</p>
</div>
</div>
</div>
<div id="outline-container-org9d59223" class="outline-2">
<h2 id="org9d59223"><span class="section-number-2">7.</span> Choosing a DB</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgd3cd27f" class="outline-3">
<h3 id="orgd3cd27f"><span class="section-number-3">7.1.</span> Relational DB</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Relational DB is most common, traditional solution.
Use transactions for steps to be completed atomically together.
</p>
</div>
</div>
<div id="outline-container-org112e5e2" class="outline-3">
<h3 id="org112e5e2"><span class="section-number-3">7.2.</span> NoSQL DB</h3>
<div class="outline-text-3" id="text-7-2">
<p>
Transactions less common on NoSQL DBs, since slow.
Transactions less necessary since a single key stores a lot of related data that can be modified at once.
</p>

<p>
Transaction can be implemented by locking the keys involved:
</p>
<ol class="org-ol">
<li>lock keys involved (lock prevents reads/writes)
<ol class="org-ol">
<li>replicas must agree to lock</li>
<li>multiple competing lock requests may occur in parallel, but once must
be chosen, so multiple rounds of communication may be needed to agree</li>
</ol></li>
<li>execute transaction on all replaces, and wait for all to confirm</li>
<li>unlock key involved (let reads/writes proceed)</li>
</ol>

<p>
To implement distributed lock:
</p>
<ul class="org-ul">
<li>requires atomic conditional write operation
<ul class="org-ul">
<li>many NoSQL DBs support something like this</li>
</ul></li>
<li>if scalability not a concern
<ul class="org-ul">
<li>store transactional data in a SQL DB</li>
<li>use a SQL DB to implement lock used to control access in NoSQL</li>
</ul></li>
</ul>
</div>
</div>
