3B/SE464/06-DB-Scaling.tex
\subsection{Consistency}
\label{sec:orgc6a3ea4}
\textbf{CAP Theorem}: a distributed system cannot achieve all 3 of the following:
\begin{itemize}
\item \textbf{Consistency}: reads always get the most recent write
\item \textbf{Availability}: every request received a non-error response
\item \textbf{Partition Tolerance}: arbitrary number of messages between nodes can be dropped (or delayed)
\end{itemize}

When distributed DB nodes are out-of-sync, must either accept consistent responses or wait for nodes
to resynchronize.

To build distributed DB where every request immediately gets a globally correct response, need a network
that is 100\% reliable and has no delay.

CAP theorem gives tradeoff between consistency and delay.
Inconsistency more important than delay (only centralized DB can give both).

Distributed NoSQL DB designs give different options for handling consistency/delay tradeoff.

Client-centric consistency properties:
\begin{itemize}
\item \textbf{monotonic reads}: if client reads the value of \(x\), later reads of \(x\) by the same client will
return the same value or a more recently written value
\begin{itemize}
\item can fail from reads from different nodes during incomplete write
\item prevent problem by making client connect to same node for every request or delay second request
\end{itemize}
\item \textbf{read your writes}: if client writes value to \(x\), later reads of \(x\) by the same client always returns
same value or a more recently written value
\begin{itemize}
\item can fail if system allows write on one node and read from another
\item prevent problem by making client connect to same node for every request or delay second request
\end{itemize}
\item \textbf{monotonic writes}: if client writes twice to \(x\), first write must happen before second
\begin{itemize}
\item second write can occur on a node before first write arrives
\item does not matter unless writes are cumulative
\item prevent problem by making client connect to same node for every request or delay second request
\end{itemize}
\end{itemize}

To achieve consistency:
\begin{enumerate}
\item make client send all requests to one replica node
\begin{enumerate}
\item simple solution, but consistency problems arise when node fails
\end{enumerate}
\item make client wait until read or write is synchronized across whole system
\begin{enumerate}
\item simplest approach is for client to send request to all nodes and wait
\end{enumerate}
\end{enumerate}

For \uline{monotonic read}, wait for all nodes to return same value.
For \uline{read your writes}, wait for all nodes to acknowledge write.

\textbf{Quorum}: min percentage of committee needed to act

Wait for quorum of acknowledgment of consistent data before considering read/write completed
Prevent progress until replicas have certain degree of consistency.

Read/write quorum of majority gives balanced read/write performance.

Send request to all nodes but wait for quorum of responses.

In practice, there can be many nodes, but a constant number of replicas for each data key.
Quorum only applies to replica nodes.

A distributed system is \textbf{linearizable} if the partial ordering of distributed actions is preserved:
\begin{itemize}
\item distributed actors each know the order of their own actions
\item certain knowledge must never be contradicted by the distributed system
\item creates a partial ordering of all events in the distributed system
\end{itemize}

Every observed serialization of the parallel activity must be agreeable to individual actors.
Observations will vary across the system.

In addition to NoSQL DBs, distributed file systems can use DHTs.
Path is key, value is file contents.
\section{Choosing a DB}
\label{sec:orgb47a85f}
\subsection{Relational DB}
\label{sec:org2af33b0}
Relational DB is most common, traditional solution.
Use transactions for steps to be completed atomically together.
\subsection{NoSQL DB}
\label{sec:org16ea52f}
Transactions less common on NoSQL DBs, since slow.
Transactions less necessary since a single key stores a lot of related data that can be modified at once.

Transaction can be implemented by locking the keys involved:
\begin{enumerate}
\item lock keys involved (lock prevents reads/writes)
\begin{enumerate}
\item replicas must agree to lock
\item multiple competing lock requests may occur in parallel, but once must
be chosen, so multiple rounds of communication may be needed to agree
\end{enumerate}
\item execute transaction on all replaces, and wait for all to confirm
\item unlock key involved (let reads/writes proceed)
\end{enumerate}

To implement distributed lock:
\begin{itemize}
\item requires atomic conditional write operation
\begin{itemize}
\item many NoSQL DBs support something like this
\end{itemize}
\item if scalability not a concern
\begin{itemize}
\item store transactional data in a SQL DB
\item use a SQL DB to implement lock used to control access in NoSQL
\end{itemize}
\end{itemize}
