3B/SE464/06-DB-Scaling.html
<div id="outline-container-orgde41482" class="outline-3">
<h3 id="orgde41482"><span class="section-number-3">7.3.</span> Column-Oriented Relational DB</h3>
<div class="outline-text-3" id="text-7-3">
<p>
Read-replicas and sharding help for online transaction processing.
</p>

<p>
<b>Online Analytics Processing</b> (OLAP) involves few large queries:
</p>
<ul class="org-ul">
<li>analytics queries with scanning tables, not using indexes</li>
<li>must be parallelized over many nodes</li>
<li>workload is mostly reads, with occasional importing of new data</li>
</ul>

<p>
Column-oriented DBs optimized for SQL analytics workloads.
</p>
</div>
</div>
<div id="outline-container-orgafd134f" class="outline-3">
<h3 id="orgafd134f"><span class="section-number-3">7.4.</span> Semi-Structured Stores</h3>
<div class="outline-text-3" id="text-7-4">
<p>
MongoDB stores JSON objects.
Best for changing and keeping history of JSON documents.
</p>

<p>
MongoDB details:
</p>
<ul class="org-ul">
<li>built-in sharding</li>
<li>master/slave replication</li>
<li>JS expressions as queries</li>
<li>runs arbitrary JS functions</li>
<li>performance over features</li>
<li>best for dynamic queries, preferring indexes over functions, good performance on big DB, and if
documents change frequently and keeping history</li>
</ul>

<p>
ElasticSearch also stores JSON documents, but indexes every word in the document and to handle
advanced queries.
Uses inverted index with DHT.
ElasticSearch is advanced search.
Best for objects with flexible fields (plain text) and need search by all words in the document
or need to construct complex search queries.
</p>

<p>
Cassandra rows have key mapped to value, which is group of columns mapped to values.
Column names are indexed within the row.
Row key is the hashing key that determines on which nodes the row is stored.
Cassandra stores huge datasets.
Best for when requirement is to store data so huge that it doesn&rsquo;t fit on the server, but still want a
familiar interface to it.
</p>

<p>
DynamoDB is 2D key-value store, with <b>partition key</b> (hashed to find partition), <b>sort key</b> (allows
efficient range queries withing partition key), <b>primary key</b> (from partition and sort keys together),
and <b>attributes</b> (key-value pairs stored under primary key).
</p>
</div>
</div>
<div id="outline-container-orgd456908" class="outline-3">
<h3 id="orgd456908"><span class="section-number-3">7.5.</span> Distributed Cache</h3>
<div class="outline-text-3" id="text-7-5">
<p>
All data stored in RAM for high performance.
Redis understands many types of data values.
</p>

<p>
Originally developed to reduce load on relational DBs through caching.
</p>

<p>
Same basic key-value abstraction as NoSQL distributed DBs.
Store data across many nodes.
</p>

<p>
Have same data consistency issues as NoSQL DBs.
</p>

<p>
Optimized to do everything in memory (except storage on disk).
</p>

<p>
In cache, items expire, speed is primary goal, and capacity is limited.
</p>

<p>
As opposed to CDN, distributed cache caches commonly used data that contributes to responses.
</p>

<p>
Redis is blazing fast storage.
Best used for rapidly changing data with a foreseeable DB size and for caching data that can be rebuilt
from another data store.
</p>
</div>
</div>
<div id="outline-container-orgff128ae" class="outline-3">
<h3 id="orgff128ae"><span class="section-number-3">7.6.</span> Networked File Systems and Cloud</h3>
<div class="outline-text-3" id="text-7-6">
<p>
<b>Networked file system</b> provides regular filesystem interface to applications by mounting remote drive.
Not too useful today, but may be necessary if app is built to work directly with local file system.
Modern apps should instead interact with cloud-based storage services.
</p>

<p>
<b>Cloud object store (S3)</b> is a flexible general-purpose file store for cloud apps, managed by a cloud
provider (unlimited capacity).
Provides a network API for accessing files (like REST), so app accesses files like remote DB.
</p>

<p>
<b>Hadoop File System</b> is good for using Hadoop/Spark for distributed processing, where data too big
to move for analytics.
Allows data to reside on same machines where computation happens, making processing efficient.
Designed to work well with Hadoop distributed processing tools.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-12-07 Sat 16:59</p>
</div>
</body>
</html>
