3B/SE464/06-DB-Scaling.tex
\subsection{Column-Oriented Relational DB}
\label{sec:org24cee10}
Read-replicas and sharding help for online transaction processing.

\textbf{Online Analytics Processing} (OLAP) involves few large queries:
\begin{itemize}
\item analytics queries with scanning tables, not using indexes
\item must be parallelized over many nodes
\item workload is mostly reads, with occasional importing of new data
\end{itemize}

Column-oriented DBs optimized for SQL analytics workloads.
\subsection{Semi-Structured Stores}
\label{sec:org4f9c01f}
MongoDB stores JSON objects.
Best for changing and keeping history of JSON documents.

MongoDB details:
\begin{itemize}
\item built-in sharding
\item master/slave replication
\item JS expressions as queries
\item runs arbitrary JS functions
\item performance over features
\item best for dynamic queries, preferring indexes over functions, good performance on big DB, and if
documents change frequently and keeping history
\end{itemize}

ElasticSearch also stores JSON documents, but indexes every word in the document and to handle
advanced queries.
Uses inverted index with DHT.
ElasticSearch is advanced search.
Best for objects with flexible fields (plain text) and need search by all words in the document
or need to construct complex search queries.

Cassandra rows have key mapped to value, which is group of columns mapped to values.
Column names are indexed within the row.
Row key is the hashing key that determines on which nodes the row is stored.
Cassandra stores huge datasets.
Best for when requirement is to store data so huge that it doesn't fit on the server, but still want a
familiar interface to it.

DynamoDB is 2D key-value store, with \textbf{partition key} (hashed to find partition), \textbf{sort key} (allows
efficient range queries withing partition key), \textbf{primary key} (from partition and sort keys together),
and \textbf{attributes} (key-value pairs stored under primary key).
\subsection{Distributed Cache}
\label{sec:orge6f217b}
All data stored in RAM for high performance.
Redis understands many types of data values.

Originally developed to reduce load on relational DBs through caching.

Same basic key-value abstraction as NoSQL distributed DBs.
Store data across many nodes.

Have same data consistency issues as NoSQL DBs.

Optimized to do everything in memory (except storage on disk).

In cache, items expire, speed is primary goal, and capacity is limited.

As opposed to CDN, distributed cache caches commonly used data that contributes to responses.

Redis is blazing fast storage.
Best used for rapidly changing data with a foreseeable DB size and for caching data that can be rebuilt
from another data store.
\subsection{Networked File Systems and Cloud}
\label{sec:org2ff7690}
\textbf{Networked file system} provides regular filesystem interface to applications by mounting remote drive.
Not too useful today, but may be necessary if app is built to work directly with local file system.
Modern apps should instead interact with cloud-based storage services.

\textbf{Cloud object store (S3)} is a flexible general-purpose file store for cloud apps, managed by a cloud
provider (unlimited capacity).
Provides a network API for accessing files (like REST), so app accesses files like remote DB.

\textbf{Hadoop File System} is good for using Hadoop/Spark for distributed processing, where data too big
to move for analytics.
Allows data to reside on same machines where computation happens, making processing efficient.
Designed to work well with Hadoop distributed processing tools.
\end{document}
